[
    {
        "title" : "Arborist Reports",
        "description": "Arborist Reports is a desktop application that provides the user with a form and generates a pdf based on the information provided. I developed this application to give to a local arborist that I have mutual connections with as they spent a majority of their time creating the reports. What my product does is takes a report template and fills in information in the appropriate locations. The data was placed into the report in different ways such as a paragraph, table, and images. These images were also generated through my application by using measurements given by the user and producing an image. Overall, I believe this application will reduce the amount of time spent on creating these reports by 80%.",
        "github": "https://github.com/thomascowan/Arborist-Reports",
        "imageName" : ["https://images.unsplash.com/photo-1524781289445-ddf8f5695861?ixlib=rb-4.0.3&ixid=MnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8&auto=format&fit=crop&w=1770&q=80"]
    },
    {
        "title" : "Macquarie Autonomous Transit System",
        "description": "The Macquarie Autonomous Transit System (MQ-ATS) was a project developed in my third year studying at Macquarie University in a class called “Engineering Project Practice”. The task this year was the build an autonomous transit system that would be capable of detecting when upcoming stations are and react according to the current instructions provided to it. Similar to my project last year, I was placed into the communications branch and placed into a smaller team focusing on the control box. Within the control box, three main pieces of functionality needed to be implemented; the state machine, the user interface, and the Bluetooth communication. I was tasked with developing the Bluetooth communication that allowed the control box and the motor controller to communicate. I did this by building frames of data to be sent between each component through Bluetooth via the serial port on the Arduino Uno and Arduino Mega. One byte of information was sent in each message allowing for 256 different states to be communicated at any time. Unfortunately by the end of the project, we did not have enough time left to test.",
        "github": "",
        "imageName" : ["https://images.unsplash.com/photo-1610194352361-4c81a6a8967e?ixlib=rb-4.0.3&ixid=MnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8&auto=format&fit=crop&w=1674&q=80"]
    },
    {
        "title" : "Tetris",
        "description": "This project was undertaken by my for no other reason than for fun. During summer break, I wanted to brush up my coding skills so that I would not forget all that I have learnt so far and not need to spend time getting back into the swing of things when the next semester started back up again. I decided to keep in practice by developing my version of Tetris. My version of Tetris is rather lack-luster as I attempted to make an exact copy of the original.",
        "github": "https://github.com/thomascowan/Tetris",
        "imageName" : ["https://images.unsplash.com/photo-1618202133208-2907bebba9e1?ixlib=rb-4.0.3&ixid=MnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8&auto=format&fit=crop&w=1770&q=80"]
    },{
        "title" : "Elevator Challenge",
        "description": "During my second year studying Engineering at Macquarie University, I completed a class called “Engineering Practice Projects” where I was placed into a team to assist in developing the chosen project. This year the chosen project was to build a functioning model elevator. Each group was first separated by their faculty and set to complete work related to their field, for me I was placed into the Communications field. Teams were further broken down into more module-specific groups as there were numerous parts that needed to be completed. My team and I were responsible for the motor controls and the sensors. I took lead on the sensors and by the end of the project, they were able to read in information about the current state of the elevator and relay that information back to the state machine allowing it to operate optimally. By the end of the project, our elevator worked with only some minor flaws. These flaws would include; level misalignment and incorrect display of floors. While these flaws were present, the overall outcome of the project was good as the elevator was able to move and correctly choose floors to visit in the optimal order.",
        "github": "",
        "imageName" : ["https://images.unsplash.com/photo-1495805442109-bf1cf975750b?ixlib=rb-4.0.3&ixid=MnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8&auto=format&fit=crop&w=1770&q=80"]
    },{
        "title" : "FAKE",
        "description": "During my second year studying Engineering at Macquarie University, I completed a class called “Engineering Practice Projects” where I was placed into a team to assist in developing the chosen project. This year the chosen project was to build a functioning model elevator. Each group was first separated by their faculty and set to complete work related to their field, for me I was placed into the Communications field. Teams were further broken down into more module-specific groups as there were numerous parts that needed to be completed. My team and I were responsible for the motor controls and the sensors. I took lead on the sensors and by the end of the project, they were able to read in information about the current state of the elevator and relay that information back to the state machine allowing it to operate optimally. By the end of the project, our elevator worked with only some minor flaws. These flaws would include; level misalignment and incorrect display of floors. While these flaws were present, the overall outcome of the project was good as the elevator was able to move and correctly choose floors to visit in the optimal order.",
        "github": "",
        "imageName" : ["https://images.unsplash.com/photo-1516681100942-77d8e7f9dd97?ixlib=rb-4.0.3&ixid=MnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8&auto=format&fit=crop&w=1770&q=80"]
    }
]
